export const Tz = () => {
  return (
    <div className="text-gray-600 space-y-4 text-sm">
      <h2 className="text-2xl">
        Технічне завдання: Фільтр для товарів (вентилятори)
      </h2>
      <ul className="space-y-4">
        <li>
          <h3 className="text-xl">
            Загальна структура фільтра Фільтр повинен складатися з таких блоків:
          </h3>
          <ul className="space-y-2 indent-2">
            <li>
              Потужність двигуна, кВт. Мінімум: 750, Максимум: 110000, Вивід
              значення: у кВт з округленням до сотих (0.00 кВт)
            </li>
            <li>
              Продуктивність, м³/год. Мінімум: 850, Максимум: 160000, Вивід
              значення: м³/год
            </li>
            <li>Тиск, Па. Мінімум: 165, Максимум: 1780, Вивід значення: Па</li>
          </ul>
        </li>

        <li className="mb-2">
          Повзунки повинні мати відображення мінімального та максимального
          значення у текстових полях.
        </li>

        <li className="space-y-1">
          <h3 className="text-xl">Списки з чекбоксами:</h3>
          <ul className="space-y-2 indent-2">
            <li>
              Типорозмір (номер): №2, №2,5, №3,15, №4, №5, №6,3, №8, №10, №20,
              №16, №12,5, №14
            </li>
            <li>
              Матеріал виконання: Вуглецева сталь, Нержавіюча сталь, Алюміній
            </li>
            <li>Оберти двигуна, об/хв: 750, 1000, 1500, 3000</li>
          </ul>
        </li>

        <li className="space-y-1">
          <h3 className="text-xl">Кнопка: Детальний підбір</h3>
          <ul className="space-y-2 indent-2">
            <li>
              Відображалє або ховалє додаткові фільтри, коли вона натискається.
            </li>
          </ul>
        </li>

        <li className="space-y-1">
          <h3 className="text-xl">Функціональні вимоги:</h3>
          <ul className="space-y-2 indent-2">
            <li>
              Усі фільтри мають бути незалежними, але повинні працювати сумісно
              при комбінаціях вибору.
            </li>
            <li>
              Підтримка збереження обраних фільтрів при перезавантаженні
              сторінки або навігації (наприклад, через URL-параметри).
            </li>
            <li>
              Можливість розширення фільтра додатковими параметрами в
              майбутньому
            </li>
            <li>ЧПУ підтримка для параметрів фільтра</li>
          </ul>
        </li>

        <li className="space-y-1">
          <h3 className="text-xl">Адмін-панель:</h3>
          <ul className="space-y-2 indent-2">
            <li>Увімкнення/вимкнення окремих блоків фільтра</li>
            <li>Налаштування діапазонів значень (мін/макс)</li>
            <li>Налаштування списків чекбоксів</li>
          </ul>
        </li>
      </ul>
    </div>
  );
};
